--------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\ado\ian\rctmiss/testlogs/rctmiss_cscript.log
  log type:  text
 opened on:  25 Apr 2019, 17:32:03

. 
. pda

. set tracedepth 1

. set trace off

. set more off

. 
. which rctmiss, all

c:\ado\ian\rctmiss/package/rctmiss.ado
*! version 0.12.5 IRW 25apr2019

c:\ado\stbplus\r\rctmiss.ado
*! version 0.12.4 IRW 13dec2018

. 
end of do-file

. cd C:\ado\ian\rctmiss\package
C:\ado\ian\rctmiss\package

. do "C:\Users\rmjwiww\AppData\Local\Temp\STD17b4_000000.tmp"

. 
. use UK500, clear
(Random sample of 500 individuals from UK700 trial (Lancet, 1999))

. 
. * Analysis assuming MAR, dropping missing baselines:
. 
. reg sat96 rand sat94 i.centreid

      Source |       SS           df       MS      Number of obs   =       288
-------------+----------------------------------   F(5, 282)       =      7.64
       Model |  769.430151         5   153.88603   Prob > F        =    0.0000
    Residual |  5676.73109       282  20.1302521   R-squared       =    0.1194
-------------+----------------------------------   Adj R-squared   =    0.1037
       Total |  6446.16124       287  22.4604921   Root MSE        =    4.4867

------------------------------------------------------------------------------
       sat96 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |   -.164473   .5335417    -0.31   0.758    -1.214703    .8857569
       sat94 |   .2674226   .0568585     4.70   0.000     .1555016    .3793436
             |
    centreid |
 Manchester  |  -.7604349   .8715783    -0.87   0.384     -2.47606    .9551902
  St Mary's  |   1.042237   .8248935     1.26   0.207    -.5814929    2.665968
     King's  |   1.335646   .8502843     1.57   0.117    -.3380638    3.009356
             |
       _cons |    11.7432   1.220158     9.62   0.000     9.341429    14.14497
------------------------------------------------------------------------------

. 
. * Analysis assuming MAR, with mean imputation for missing baselines
. gen sat94fill = sat94
(101 missing values generated)

. summ sat94

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       sat94 |        399     19.1037    4.717492          9         36

. replace sat94fill = r(mean) if mi(sat94)
(101 real changes made)

. reg sat96 rand sat94fill i.centreid

      Source |       SS           df       MS      Number of obs   =       349
-------------+----------------------------------   F(5, 343)       =      7.95
       Model |  808.678471         5  161.735694   Prob > F        =    0.0000
    Residual |  6980.36818       343  20.3509276   R-squared       =    0.1038
-------------+----------------------------------   Adj R-squared   =    0.0908
       Total |  7789.04665       348   22.382318   Root MSE        =    4.5112

------------------------------------------------------------------------------
       sat96 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |  -.3098219   .4886421    -0.63   0.526    -1.270934    .6512903
   sat94fill |   .2721688   .0568463     4.79   0.000     .1603576      .38398
             |
    centreid |
 Manchester  |   -.990563   .7049489    -1.41   0.161     -2.37713     .396004
  St Mary's  |    .916381   .6994001     1.31   0.191    -.4592721    2.292034
     King's  |   1.008018   .7117951     1.42   0.158    -.3920145    2.408051
             |
       _cons |   11.84994     1.1692    10.14   0.000     9.550235    14.14964
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\rmjwiww\AppData\Local\Temp\STD17b4_000000.tmp"

. 
. * Same using rctmiss
. 
. xi: rctmiss, pmmdelta(0): reg sat96 rand sat94 i.centreid
i.centreid        _Icentreid_0-3      (naturally coded; _Icentreid_0 omitted)

---------- RCT analysis allowing for informatively missing outcomes ----------
Incomplete covariate:    sat94 has 101 missing values
                           - imputed with the mean
Observed outcomes:       349
Unobserved outcomes:     151
Missing data assumption: MAR (missing values ignored)
Missing data model:      Pattern-mixture model
Delta:                   0
Auxiliary variables:     (none)
Estimation method:       Two linear regressions
Effective sample size:   349
------------------------------------------------------------------------------
       sat96 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |  -.3098219   .4886421    -0.63   0.526    -1.270934    .6512903
       sat94 |   .2721688   .0568463     4.79   0.000     .1603576      .38398
_Icentreid_1 |   -.990563   .7049489    -1.41   0.161     -2.37713     .396004
_Icentreid_2 |    .916381   .6994001     1.31   0.191    -.4592721    2.292034
_Icentreid_3 |   1.008018   .7117951     1.42   0.158    -.3920145    2.408051
       _cons |   11.84994     1.1692    10.14   0.000     9.550235    14.14964
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\rmjwiww\AppData\Local\Temp\STD17b4_000000.tmp"

. 
. xi: rctmiss, pmmdelta(-5): reg sat96 rand sat94 i.centreid
i.centreid        _Icentreid_0-3      (naturally coded; _Icentreid_0 omitted)

---------- RCT analysis allowing for informatively missing outcomes ----------
Incomplete covariate:    sat94 has 101 missing values
                           - imputed with the mean
Observed outcomes:       349
Unobserved outcomes:     151
Missing data assumption: MNAR
Missing data model:      Pattern-mixture model
Delta:                   -5
Auxiliary variables:     (none)
Estimation method:       Two linear regressions
Effective sample size:   364.3761
------------------------------------------------------------------------------
       sat96 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |   .2871541   .5278782     0.54   0.587    -.7509741    1.325282
       sat94 |   .2329311   .0614268     3.79   0.000     .1121288    .3537334
_Icentreid_1 |   .3854468   .7556709     0.51   0.610     -1.10066    1.871553
_Icentreid_2 |   1.441284   .7577516     1.90   0.058    -.0489147    2.931482
_Icentreid_3 |   2.166997   .7689544     2.82   0.005     .6547674    3.679227
       _cons |   10.07869   1.260756     7.99   0.000      7.59928     12.5581
------------------------------------------------------------------------------

. 
end of do-file

. do "C:\Users\rmjwiww\AppData\Local\Temp\STD17b4_000000.tmp"

. 
. xi: rctmiss, sens(rand) pmmdelta(-10/0): reg sat96 rand sat94 i.centreid
i.centreid        _Icentreid_0-3      (naturally coded; _Icentreid_0 omitted)

---------- RCT analysis allowing for informatively missing outcomes ----------
Incomplete covariate:    sat94 has 101 missing values
                           - imputed with the mean
Observed outcomes:       349
Unobserved outcomes:     151
Missing data assumption: Various (sensitivity analysis)
Missing data model:      Pattern-mixture model
Delta:                   -10/0 (base = 0)
Auxiliary variables:     (none)
Estimation method:       Two linear regressions
Performing sensitivity analyses...........
Drawing graph...

. 
end of do-file

. do "C:\Users\rmjwiww\AppData\Local\Temp\STD17b4_000000.tmp"

. 
. xi: rctmiss, pmmdelta(-10/0) ///
>         sens(rand, legend(rows(3)) stagger(0.05) list(sepby(delta)) ///
>                 title(Sensitivity analysis for UK500 data)): ///
>         reg sat96 rand sat94 i.centreid
i.centreid        _Icentreid_0-3      (naturally coded; _Icentreid_0 omitted)

---------- RCT analysis allowing for informatively missing outcomes ----------
Incomplete covariate:    sat94 has 101 missing values
                           - imputed with the mean
Observed outcomes:       349
Unobserved outcomes:     151
Missing data assumption: Various (sensitivity analysis)
Missing data model:      Pattern-mixture model
Delta:                   -10/0 (base = 0)
Auxiliary variables:     (none)
Estimation method:       Two linear regressions
Performing sensitivity analyses...........

     +-------------------------------------------------------------------------------------+
     |                           type   delta           b         se        dof       neff |
     |-------------------------------------------------------------------------------------|
  1. | Intensive case management only     -10   -2.747419   .5573085   366.7696   372.7696 |
  2. |                      both arms     -10    .8841302   .6311166   389.9478   395.9478 |
  3. |  Standard case management only     -10    3.321728   .5740017   371.5454   377.5454 |
     |-------------------------------------------------------------------------------------|
  4. | Intensive case management only      -9    -2.50366   .5449281   363.1418   369.1418 |
  5. |                      both arms      -9     .764735   .6066269   383.4452   389.4452 |
  6. |  Standard case management only      -9    2.958573   .5587877   367.2632   373.2632 |
     |-------------------------------------------------------------------------------------|
  7. | Intensive case management only      -8     -2.2599   .5336075   359.6118   365.6118 |
  8. |                      both arms      -8    .6453398   .5838449   376.8874   382.8874 |
  9. |  Standard case management only      -8    2.595418   .5448151   363.0646   369.0646 |
     |-------------------------------------------------------------------------------------|
 10. | Intensive case management only      -7    -2.01614   .5234154    356.239    362.239 |
 11. |                      both arms      -7    .5259445    .562978   370.4089   376.4089 |
 12. |  Standard case management only      -7    2.232263   .5321819    359.027    365.027 |
     |-------------------------------------------------------------------------------------|
 13. | Intensive case management only      -6    -1.77238    .514419   353.0907   359.0907 |
 14. |                      both arms      -6    .4065493   .5442467   364.1745   370.1745 |
 15. |  Standard case management only      -6    1.869108   .5209852   355.2383   361.2383 |
     |-------------------------------------------------------------------------------------|
 16. | Intensive case management only      -5   -1.528621   .5066819   350.2406   356.2406 |
 17. |                      both arms      -5    .2871541   .5278782   358.3761   364.3761 |
 18. |  Standard case management only      -5    1.505953   .5113197   351.7942   357.7942 |
     |-------------------------------------------------------------------------------------|
 19. | Intensive case management only      -4   -1.284861   .5002625   347.7658   353.7658 |
 20. |                      both arms      -4    .1677589   .5140983   353.2234   359.2234 |
 21. |  Standard case management only      -4    1.142798   .5032735   348.7945   354.7945 |
     |-------------------------------------------------------------------------------------|
 22. | Intensive case management only      -3   -1.041101   .4952121   345.7422   351.7422 |
 23. |                      both arms      -3    .0483637   .5031197   348.9304   354.9304 |
 24. |  Standard case management only      -3    .7796429   .4969253   346.3367   352.3367 |
     |-------------------------------------------------------------------------------------|
 25. | Intensive case management only      -2   -.7973415    .491573   344.2393   350.2393 |
 26. |                      both arms      -2   -.0710315   .4951289    345.696    351.696 |
 27. |  Standard case management only      -2     .416488   .4923407   344.5087   350.5087 |
     |-------------------------------------------------------------------------------------|
 28. | Intensive case management only      -1   -.5535817   .4893765    343.313    349.313 |
 29. |                      both arms      -1   -.1904267   .4902719   343.6834   349.6834 |
 30. |  Standard case management only      -1     .053333   .4895694   343.3811   349.3811 |
     |-------------------------------------------------------------------------------------|
 31. | Intensive case management only       0   -.3098219   .4886421        343        349 |
 32. |                      both arms       0   -.3098219   .4886421        343        349 |
 33. |  Standard case management only       0   -.3098219   .4886421        343        349 |
     +-------------------------------------------------------------------------------------+
Drawing graph...

. 
end of do-file

. do "C:\Users\rmjwiww\AppData\Local\Temp\STD17b4_000000.tmp"

. /* 
> rctmiss.do: example of -rctmiss-, following help file
> 
> History:
> 25apr2019 syntax corrected - sens options become suboptions
> 12jan2017 created
> 
> Notes:
> Start in C:\ado\ian\rctmiss\package
> */
. 
. // UK500 data (quantitative outcome)
. 
. use UK500, clear
(Random sample of 500 individuals from UK700 trial (Lancet, 1999))

. 
. * Analysis assuming MAR, dropping missing baselines:
. 
. reg sat96 rand sat94 i.centreid

      Source |       SS           df       MS      Number of obs   =       288
-------------+----------------------------------   F(5, 282)       =      7.64
       Model |  769.430151         5   153.88603   Prob > F        =    0.0000
    Residual |  5676.73109       282  20.1302521   R-squared       =    0.1194
-------------+----------------------------------   Adj R-squared   =    0.1037
       Total |  6446.16124       287  22.4604921   Root MSE        =    4.4867

------------------------------------------------------------------------------
       sat96 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |   -.164473   .5335417    -0.31   0.758    -1.214703    .8857569
       sat94 |   .2674226   .0568585     4.70   0.000     .1555016    .3793436
             |
    centreid |
 Manchester  |  -.7604349   .8715783    -0.87   0.384     -2.47606    .9551902
  St Mary's  |   1.042237   .8248935     1.26   0.207    -.5814929    2.665968
     King's  |   1.335646   .8502843     1.57   0.117    -.3380638    3.009356
             |
       _cons |    11.7432   1.220158     9.62   0.000     9.341429    14.14497
------------------------------------------------------------------------------

. 
. * Analysis assuming MAR, with mean imputation for missing baselines
. gen sat94fill = sat94
(101 missing values generated)

. summ sat94

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       sat94 |        399     19.1037    4.717492          9         36

. replace sat94fill = r(mean) if mi(sat94)
(101 real changes made)

. reg sat96 rand sat94fill i.centreid

      Source |       SS           df       MS      Number of obs   =       349
-------------+----------------------------------   F(5, 343)       =      7.95
       Model |  808.678471         5  161.735694   Prob > F        =    0.0000
    Residual |  6980.36818       343  20.3509276   R-squared       =    0.1038
-------------+----------------------------------   Adj R-squared   =    0.0908
       Total |  7789.04665       348   22.382318   Root MSE        =    4.5112

------------------------------------------------------------------------------
       sat96 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |  -.3098219   .4886421    -0.63   0.526    -1.270934    .6512903
   sat94fill |   .2721688   .0568463     4.79   0.000     .1603576      .38398
             |
    centreid |
 Manchester  |   -.990563   .7049489    -1.41   0.161     -2.37713     .396004
  St Mary's  |    .916381   .6994001     1.31   0.191    -.4592721    2.292034
     King's  |   1.008018   .7117951     1.42   0.158    -.3920145    2.408051
             |
       _cons |   11.84994     1.1692    10.14   0.000     9.550235    14.14964
------------------------------------------------------------------------------

. 
. * Same using rctmiss
. 
. xi: rctmiss, pmmdelta(0): reg sat96 rand sat94 i.centreid
i.centreid        _Icentreid_0-3      (naturally coded; _Icentreid_0 omitted)

---------- RCT analysis allowing for informatively missing outcomes ----------
Incomplete covariate:    sat94 has 101 missing values
                           - imputed with the mean
Observed outcomes:       349
Unobserved outcomes:     151
Missing data assumption: MAR (missing values ignored)
Missing data model:      Pattern-mixture model
Delta:                   0
Auxiliary variables:     (none)
Estimation method:       Two linear regressions
Effective sample size:   349
------------------------------------------------------------------------------
       sat96 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |  -.3098219   .4886421    -0.63   0.526    -1.270934    .6512903
       sat94 |   .2721688   .0568463     4.79   0.000     .1603576      .38398
_Icentreid_1 |   -.990563   .7049489    -1.41   0.161     -2.37713     .396004
_Icentreid_2 |    .916381   .6994001     1.31   0.191    -.4592721    2.292034
_Icentreid_3 |   1.008018   .7117951     1.42   0.158    -.3920145    2.408051
       _cons |   11.84994     1.1692    10.14   0.000     9.550235    14.14964
------------------------------------------------------------------------------

. 
. * Single MNAR analysis, assuming missing values are 5 units lower than observed values in both arms:
. 
. xi: rctmiss, pmmdelta(-5): reg sat96 rand sat94 i.centreid
i.centreid        _Icentreid_0-3      (naturally coded; _Icentreid_0 omitted)

---------- RCT analysis allowing for informatively missing outcomes ----------
Incomplete covariate:    sat94 has 101 missing values
                           - imputed with the mean
Observed outcomes:       349
Unobserved outcomes:     151
Missing data assumption: MNAR
Missing data model:      Pattern-mixture model
Delta:                   -5
Auxiliary variables:     (none)
Estimation method:       Two linear regressions
Effective sample size:   364.3761
------------------------------------------------------------------------------
       sat96 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |   .2871541   .5278782     0.54   0.587    -.7509741    1.325282
       sat94 |   .2329311   .0614268     3.79   0.000     .1121288    .3537334
_Icentreid_1 |   .3854468   .7556709     0.51   0.610     -1.10066    1.871553
_Icentreid_2 |   1.441284   .7577516     1.90   0.058    -.0489147    2.931482
_Icentreid_3 |   2.166997   .7689544     2.82   0.005     .6547674    3.679227
       _cons |   10.07869   1.260756     7.99   0.000      7.59928     12.5581
------------------------------------------------------------------------------

. 
. * Sensitivity analysis, assuming missing values are from 0 to 10 units 
. * lower than observed values, in one arm or in both arms:
. 
. xi: rctmiss, sens(rand) pmmdelta(-10/0): reg sat96 rand sat94 i.centreid
i.centreid        _Icentreid_0-3      (naturally coded; _Icentreid_0 omitted)

---------- RCT analysis allowing for informatively missing outcomes ----------
Incomplete covariate:    sat94 has 101 missing values
                           - imputed with the mean
Observed outcomes:       349
Unobserved outcomes:     151
Missing data assumption: Various (sensitivity analysis)
Missing data model:      Pattern-mixture model
Delta:                   -10/0 (base = 0)
Auxiliary variables:     (none)
Estimation method:       Two linear regressions
Performing sensitivity analyses...........
Drawing graph...

. 
. * Improving appearance:
. 
. xi: rctmiss, pmmdelta(-10/0) ///
>         sens(rand, legend(rows(3)) stagger(0.05) list(sepby(delta)) ///
>                 title(Sensitivity analysis for UK500 data)): ///
>         reg sat96 rand sat94 i.centreid
i.centreid        _Icentreid_0-3      (naturally coded; _Icentreid_0 omitted)

---------- RCT analysis allowing for informatively missing outcomes ----------
Incomplete covariate:    sat94 has 101 missing values
                           - imputed with the mean
Observed outcomes:       349
Unobserved outcomes:     151
Missing data assumption: Various (sensitivity analysis)
Missing data model:      Pattern-mixture model
Delta:                   -10/0 (base = 0)
Auxiliary variables:     (none)
Estimation method:       Two linear regressions
Performing sensitivity analyses...........

     +-------------------------------------------------------------------------------------+
     |                           type   delta           b         se        dof       neff |
     |-------------------------------------------------------------------------------------|
  1. | Intensive case management only     -10   -2.747419   .5573085   366.7696   372.7696 |
  2. |                      both arms     -10    .8841302   .6311166   389.9478   395.9478 |
  3. |  Standard case management only     -10    3.321728   .5740017   371.5454   377.5454 |
     |-------------------------------------------------------------------------------------|
  4. | Intensive case management only      -9    -2.50366   .5449281   363.1418   369.1418 |
  5. |                      both arms      -9     .764735   .6066269   383.4452   389.4452 |
  6. |  Standard case management only      -9    2.958573   .5587877   367.2632   373.2632 |
     |-------------------------------------------------------------------------------------|
  7. | Intensive case management only      -8     -2.2599   .5336075   359.6118   365.6118 |
  8. |                      both arms      -8    .6453398   .5838449   376.8874   382.8874 |
  9. |  Standard case management only      -8    2.595418   .5448151   363.0646   369.0646 |
     |-------------------------------------------------------------------------------------|
 10. | Intensive case management only      -7    -2.01614   .5234154    356.239    362.239 |
 11. |                      both arms      -7    .5259445    .562978   370.4089   376.4089 |
 12. |  Standard case management only      -7    2.232263   .5321819    359.027    365.027 |
     |-------------------------------------------------------------------------------------|
 13. | Intensive case management only      -6    -1.77238    .514419   353.0907   359.0907 |
 14. |                      both arms      -6    .4065493   .5442467   364.1745   370.1745 |
 15. |  Standard case management only      -6    1.869108   .5209852   355.2383   361.2383 |
     |-------------------------------------------------------------------------------------|
 16. | Intensive case management only      -5   -1.528621   .5066819   350.2406   356.2406 |
 17. |                      both arms      -5    .2871541   .5278782   358.3761   364.3761 |
 18. |  Standard case management only      -5    1.505953   .5113197   351.7942   357.7942 |
     |-------------------------------------------------------------------------------------|
 19. | Intensive case management only      -4   -1.284861   .5002625   347.7658   353.7658 |
 20. |                      both arms      -4    .1677589   .5140983   353.2234   359.2234 |
 21. |  Standard case management only      -4    1.142798   .5032735   348.7945   354.7945 |
     |-------------------------------------------------------------------------------------|
 22. | Intensive case management only      -3   -1.041101   .4952121   345.7422   351.7422 |
 23. |                      both arms      -3    .0483637   .5031197   348.9304   354.9304 |
 24. |  Standard case management only      -3    .7796429   .4969253   346.3367   352.3367 |
     |-------------------------------------------------------------------------------------|
 25. | Intensive case management only      -2   -.7973415    .491573   344.2393   350.2393 |
 26. |                      both arms      -2   -.0710315   .4951289    345.696    351.696 |
 27. |  Standard case management only      -2     .416488   .4923407   344.5087   350.5087 |
     |-------------------------------------------------------------------------------------|
 28. | Intensive case management only      -1   -.5535817   .4893765    343.313    349.313 |
 29. |                      both arms      -1   -.1904267   .4902719   343.6834   349.6834 |
 30. |  Standard case management only      -1     .053333   .4895694   343.3811   349.3811 |
     |-------------------------------------------------------------------------------------|
 31. | Intensive case management only       0   -.3098219   .4886421        343        349 |
 32. |                      both arms       0   -.3098219   .4886421        343        349 |
 33. |  Standard case management only       0   -.3098219   .4886421        343        349 |
     +-------------------------------------------------------------------------------------+
Drawing graph...

. 
. 
. // Smoking data (binary outcome)
. 
. use smoke, clear
(Smoking data from Sutton & Gilbert (2007): subgroup who smoked at baseline)

. 
. tab rand quit, miss

                      |               quit
                 rand |         0          1          . |     Total
----------------------+---------------------------------+----------
              Control |       364         51        150 |       565 
Tailored advice lette |       390         73        136 |       599 
----------------------+---------------------------------+----------
                Total |       754        124        286 |     1,164 

. 
. * Analysis assuming missing = smoking:
. 
. gen quit2 = quit
(286 missing values generated)

. 
. replace quit2 = 0 if missing(quit)
(286 real changes made)

. 
. logistic quit2 rand

Logistic regression                             Number of obs     =      1,164
                                                LR chi2(1)        =       3.07
                                                Prob > chi2       =     0.0798
Log likelihood = -393.29039                     Pseudo R2         =     0.0039

------------------------------------------------------------------------------
       quit2 | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |   1.398718   .2696049     1.74   0.082     .9586491      2.0408
       _cons |   .0992218   .0145668   -15.74   0.000     .0744118    .1323039
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. 
. * Same analysis using rctmiss:
. 
. rctmiss, pmmdelta(0, expdelta): logistic quit rand

---------- RCT analysis allowing for informatively missing outcomes ----------
Observed outcomes:       878
Unobserved outcomes:     286
Missing data assumption: MNAR
Missing data model:      Pattern-mixture model
Exp(delta):              0
Auxiliary variables:     (none)
Estimation method:       Full sandwich variance
Effective sample size:   1164
------------------------------------------------------------------------------
        quit | Odds ratio   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        rand |   1.398718   .2697208     1.74   0.082     .9581162    2.041935
       _cons |   .0992218   .0145731   -15.73   0.000     .0743803    .1323599
------------------------------------------------------------------------------

. 
. * Sensitivity analysis based around missing=smoking:
. 
. rctmiss, sens(rand) pmmdelta(0(0.1)1, expdelta base(0)): logistic quit rand

---------- RCT analysis allowing for informatively missing outcomes ----------
Observed outcomes:       878
Unobserved outcomes:     286
Missing data assumption: Various (sensitivity analysis)
Missing data model:      Pattern-mixture model
Exp(delta):              0(0.1)1 (base = 0)
Auxiliary variables:     (none)
Estimation method:       Full sandwich variance
Performing sensitivity analyses...........
Drawing graph...

. 
. 
end of do-file

. xi: rctmiss, pmmdelta(-10/0) sens(rand, legend(rows(3)) stagger(0.05) list(sepby(delta)) title(Sensitivity analysis for UK500 data))
> : reg sat96 rand sat94 i.centreid
variable centreid not found
r(111);

. use http://www.homepages.ucl.ac.uk/~rmjwiww/stata/missing/uk500.dta, clear
(Random sample of 500 individuals from UK700 trial (Lancet, 1999))

. xi: rctmiss, pmmdelta(-10/0) sens(rand, legend(rows(3)) stagger(0.05) list(sepby(delta)) title(Sensitivity analysis for UK500 data))
> : reg sat96 rand sat94 i.centreid
i.centreid        _Icentreid_0-3      (naturally coded; _Icentreid_0 omitted)

---------- RCT analysis allowing for informatively missing outcomes ----------
Incomplete covariate:    sat94 has 101 missing values
                           - imputed with the mean
Observed outcomes:       349
Unobserved outcomes:     151
Missing data assumption: Various (sensitivity analysis)
Missing data model:      Pattern-mixture model
Delta:                   -10/0 (base = 0)
Auxiliary variables:     (none)
Estimation method:       Two linear regressions
Performing sensitivity analyses...........

     +-------------------------------------------------------------------------------------+
     |                           type   delta           b         se        dof       neff |
     |-------------------------------------------------------------------------------------|
  1. | Intensive case management only     -10   -2.747419   .5573085   366.7696   372.7696 |
  2. |                      both arms     -10    .8841302   .6311166   389.9478   395.9478 |
  3. |  Standard case management only     -10    3.321728   .5740017   371.5454   377.5454 |
     |-------------------------------------------------------------------------------------|
  4. | Intensive case management only      -9    -2.50366   .5449281   363.1418   369.1418 |
  5. |                      both arms      -9     .764735   .6066269   383.4452   389.4452 |
  6. |  Standard case management only      -9    2.958573   .5587877   367.2632   373.2632 |
     |-------------------------------------------------------------------------------------|
  7. | Intensive case management only      -8     -2.2599   .5336075   359.6118   365.6118 |
  8. |                      both arms      -8    .6453398   .5838449   376.8874   382.8874 |
  9. |  Standard case management only      -8    2.595418   .5448151   363.0646   369.0646 |
     |-------------------------------------------------------------------------------------|
 10. | Intensive case management only      -7    -2.01614   .5234154    356.239    362.239 |
 11. |                      both arms      -7    .5259445    .562978   370.4089   376.4089 |
 12. |  Standard case management only      -7    2.232263   .5321819    359.027    365.027 |
     |-------------------------------------------------------------------------------------|
 13. | Intensive case management only      -6    -1.77238    .514419   353.0907   359.0907 |
 14. |                      both arms      -6    .4065493   .5442467   364.1745   370.1745 |
 15. |  Standard case management only      -6    1.869108   .5209852   355.2383   361.2383 |
     |-------------------------------------------------------------------------------------|
 16. | Intensive case management only      -5   -1.528621   .5066819   350.2406   356.2406 |
 17. |                      both arms      -5    .2871541   .5278782   358.3761   364.3761 |
 18. |  Standard case management only      -5    1.505953   .5113197   351.7942   357.7942 |
     |-------------------------------------------------------------------------------------|
 19. | Intensive case management only      -4   -1.284861   .5002625   347.7658   353.7658 |
 20. |                      both arms      -4    .1677589   .5140983   353.2234   359.2234 |
 21. |  Standard case management only      -4    1.142798   .5032735   348.7945   354.7945 |
     |-------------------------------------------------------------------------------------|
 22. | Intensive case management only      -3   -1.041101   .4952121   345.7422   351.7422 |
 23. |                      both arms      -3    .0483637   .5031197   348.9304   354.9304 |
 24. |  Standard case management only      -3    .7796429   .4969253   346.3367   352.3367 |
     |-------------------------------------------------------------------------------------|
 25. | Intensive case management only      -2   -.7973415    .491573   344.2393   350.2393 |
 26. |                      both arms      -2   -.0710315   .4951289    345.696    351.696 |
 27. |  Standard case management only      -2     .416488   .4923407   344.5087   350.5087 |
     |-------------------------------------------------------------------------------------|
 28. | Intensive case management only      -1   -.5535817   .4893765    343.313    349.313 |
 29. |                      both arms      -1   -.1904267   .4902719   343.6834   349.6834 |
 30. |  Standard case management only      -1     .053333   .4895694   343.3811   349.3811 |
     |-------------------------------------------------------------------------------------|
 31. | Intensive case management only       0   -.3098219   .4886421        343        349 |
 32. |                      both arms       0   -.3098219   .4886421        343        349 |
 33. |  Standard case management only       0   -.3098219   .4886421        343        349 |
     +-------------------------------------------------------------------------------------+
Drawing graph...

. use http://www.homepages.ucl.ac.uk/~rmjwiww/stata/missing/smoke.dta, clear
(Smoking data from Sutton & Gilbert (2007): subgroup who smoked at baseline)

. rctmiss, pmmdelta(0(0.1)1, expdelta base(0)) sens(rand): logistic quit rand

---------- RCT analysis allowing for informatively missing outcomes ----------
Observed outcomes:       878
Unobserved outcomes:     286
Missing data assumption: Various (sensitivity analysis)
Missing data model:      Pattern-mixture model
Exp(delta):              0(0.1)1 (base = 0)
Auxiliary variables:     (none)
Estimation method:       Full sandwich variance
Performing sensitivity analyses...........
Drawing graph...

